"0"="";
"10000"="Shooting Mode";
"10001"="Tv(Shutter Speed)";
"10002"="Av(Aperture Value)";
"10003"="AF Mode";
"10004"="Flash Exposure Compensation";
"10005"="Exposure Compensation";
"10006"="Autoexposure Bracketing";
"10007"="Metering Mode";
"10008"="White Balance Mode";
"10009"="Lens";
"10010"="AF Microadjustment";
"10011"="Focal Length";
"10012"="Flash";
"10013"="Image Size";
"10014"="Image Quality";
"10015"="Red-eye Reduction";
"10016"="Parameters Settings";
"10017"="Drive Mode";
"10018"="GPS Data";
"10019"="Owner's Name";
"10020"="Camera Body No.";
"10021"="Custom Function";
"10022"="White balance compensation";
"10023"="JPEG quality";
"10024"="Digital Exposure Compensation";
"10025"="File Name";
"10026"="Camera Model";
"10027"="Shooting Date/Time";
"10028"="ISO Speed";
"10029"="Digital Zoom";
"10030"="Movie";
"10031"="Recording Time  %d.%d";
"10032"="Frame Rate  ";
"10033"="Flash Type";
"10034"="Shutter curtain sync";
"10035"="Active AF Points";
"10036"="File Size";
"10037"="Landscape";
"10038"="ISO Speed Bracketing";
"10039"="White Balance Bracketing";
"10040"="Color Matrix";
"10041"="Noise Reduction";
"10042"="Color Space";
"10043"="    01:Long exposure noise reduction";
"10044"="    02:Shutter button/AE lock button";
"10045"="    03:Mirror lockup";
"10046"="    04:TV,AV and exposure level";
"10047"="    05:AF-assist light";
"10048"="    06:Shutter speed in Av mode";
"10049"="    07:AEB sequence/auto cancellation";
"10050"="    08:Shutter curtain sync";
"10051"="    09:Lens AF stop button Fn, switch";
"10052"="    10:Auto reduction of fill flash";
"10053"="    11:Menu button return position";
"10054"="    12:SET button func, when shooting";
"10055"="    13:Sensor cleaning";
"10056"="    14:Superimposed display";
"10057"="    15:Shutter release without CF card";
"10058"="    05:AF-assist beam/Flash firing";
"10059"="    00:Focusing Screen";
"10060"="    01:Finder display during exposure";
"10061"="    02:Shutter release without CF card";
"10062"="    03:ISO speed expansion";
"10063"="    04:Shutter button/AE lock button";
"10064"="    05:Manual Tv/Av set. for M exp.";
"10065"="    06:Exposure level increments";
"10066"="    07:USM lens electronic MF";
"10067"="    08:Top LCD panel/Back LCD panel";
"10068"="    09:Auto bracketing sequence/cancel";
"10069"="    10:AF point illumination";
"10070"="    11:AF point selection method";
"10071"="    12:Mirror lockup";
"10072"="    13:Number AF points/Spot metering";
"10073"="    14:Auto reduction of fill flash";
"10074"="    15:Shutter curtain synchronization";
"10075"="    16:Safety shift in Av or Tv";
"10076"="    17:AF point activation area";
"10077"="    18:Switch to registered AF point";
"10078"="    19:Lens AF stop button function";
"10079"="    20:AI SERVO tracking sensitivity";
"10080"="Auto";
"10081"="Program AE";
"10082"="Shutter-Priority AE";
"10083"="Aperture-Priority AE";
"10084"="Manual Exposure";
"10085"="A-DEP";
"10086"="Depth-of-Field AE";
"10087"="Bulb";
"10088"="Auto";
"10089"="Landscape";
"10090"="Night Scene";
"10091"="Black & White";
"10092"="Sepia";
"10093"="Portrait";
"10094"="Sports";
"10095"="Macro(Close Up)";
"10096"="Movie";
"10097"="Black & White";
"10098"="Flash Off(Never fires.)";
"10099"="Bulb Exposure Mode";
"10100"="One-Shot AF";
"10101"="AI Servo AF";
"10102"="AI Focus AF";
"10103"="Manual focusing";
"10104"="Manual Focus";
"10105"="Center-Weighted Average Metering";
"10106"="Spot Metering";
"10107"="Averaging Metering";
"10108"="Evaluative Metering";
"10109"="Partial Metering";
"10110"="Center-Weighted Average Metering";
"10111"="Auto";
"10112"="Daylight";
"10113"="Cloudy";
"10114"="Tungsten";
"10115"="Fluorescent";
"10116"="Flash";
"10117"="Custom";
"10118"="Black & White";
"10119"="Shade";
"10120"="Color Temperature";
"10121"="PCset1";
"10122"="PCset2";
"10123"="PCset3";
"10124"="PCset4";
"10125"="PCset5";
"10126"="Off";
"10127"="Auto";
"10128"="On";
"10129"="Auto";
"10130"="Auto";
"10131"="On";
"10132"="Economy";
"10133"="Normal";
"10134"="Fine";
"10135"="RAW";
"10136"="Superfine";
"10137"="Automatic selection";
"10138"="Off";
"10139"="On";
"10140"="Normal";
"10141"="Contrast  Low";
"10142"="Contrast  Mid. Low";
"10143"="Contrast  High";
"10144"="Contrast  Mid. High";
"10145"="Contrast  Standard";
"10146"="Sharpness  Low";
"10147"="Sharpness  Mid. Low";
"10148"="Sharpness  High";
"10149"="Sharpness  Mid. High";
"10150"="Sharpness  Standard";
"10151"="Color Saturation  Low";
"10152"="Color saturation  Mid. low";
"10153"="Color saturation  High";
"10154"="Color saturation  Mid. High";
"10155"="Color saturation  Standard";
"10156"="Single shooting";
"10157"="Continuous shooting";
"10158"="Self-Timer Operation";
"10159"="Movie shooting";
"10160"="Continuous shooting(Speed priority)";
"10161"="Low-speed continuous shooting";
"10162"="High-speed continuous shooting";
"10163"="Silent single shooting";
"10164"="Latitude";
"10165"="Longitude";
"10166"="Altitude";
"10167"="Geographic coordinate system";
"10168"="OFF";
"10169"="ON";
"10170"="Off";
"10171"="On";
"10172"="Tone Curve  Standard";
"10173"="Tone Curve  Manual set";
"10174"="Tone Curve  Custom setting";
"10175"="Tone Curve  TCD1";
"10176"="Tone Curve  TCD2";
"10177"="Tone Curve  TCD3";
"10178"="Tone Curve  Custom setting";
"10179"="Sharpness level  0";
"10180"="Sharpness level  1";
"10181"="Sharpness level  2";
"10182"="Sharpness level  3";
"10183"="Sharpness level  4";
"10184"="Sharpness level  5";
"10185"="Sharpness  0";
"10186"="Sharpness  1";
"10187"="Sharpness  2";
"10188"="Sharpness  3";
"10189"="Sharpness  4";
"10190"="Sharpness  5";
"10191"="Sharpening Target  Rough";
"10192"="Sharpening Target  Mid. rough";
"10193"="Sharpening Target  Standard";
"10194"="Sharpening Target  Mid. fine";
"10195"="Sharpening Target  Fine";
"10196"="    0:Off";
"10197"="    1:On";
"10198"="    0:AF/AE lock";
"10199"="    1:AE lock /AF";
"10200"="    2:AF/AF lock";
"10201"="    3:AE+release/AE + AF";
"10202"="    0:Disable";
"10203"="    1:Enable";
"10204"="    0:1/2-stop";
"10205"="    1:1/3-stop";
"10206"="    0:On(Auto)";
"10207"="    1:Off";
"10208"="    0:Emits/Fires";
"10209"="    1:Does not emit/Fires";
"10210"="    2:Only ext. flash emits/Fires";
"10211"="    3:Emits/Does not fire";
"10212"="    0:Auto";
"10213"="    1:1/200(fixed)";
"10214"="    0:0 => - => +/Enabled";
"10215"="    1:0 => - => +/Disabled";
"10216"="    2:- => 0 => +/Enabled";
"10217"="    3:- => 0 => +/Disabled";
"10218"="    0:1st-curtain sync";
"10219"="    1:2nd-curtain sync";
"10220"="    0:AF stop";
"10221"="    1:AF start";
"10222"="    2:AE lock with metering";
"10223"="    0:Enable";
"10224"="    1:Disable";
"10225"="    0:top";
"10226"="    1:Previous(top if powered off)";
"10227"="    2:Previous";
"10228"="    0:Default";
"10229"="    1:Change quality";
"10230"="    2:Change ISO speed";
"10231"="    3:Change parameters";
"10232"="    0:Disable";
"10233"="    1:Enable";
"10234"="    0:On";
"10235"="    1:Off";
"10236"="    0:Possible without CF card";
"10237"="    1:Not possible";
"10238"="    0:[N] Ec-N,R";
"10239"="    1:[L] Ec-A,B,C,CII,CIII,D,H,I,L";
"10240"="    0:No viewfinder display";
"10241"="    1:Finder display on";
"10242"="    0:Possible without CF card";
"10243"="    1:Not possible";
"10244"="    0:Standard ISO";
"10245"="    1:Expanded sensitivity";
"10246"="    0:AF/AE lock";
"10247"="    1:AE lock/AF";
"10248"="    2:AF/AF lock, no AE lock";
"10249"="    3:AE/AF, no AE lock";
"10250"="    0:Tv value: Main dial, Av value: Quick Control dial";
"10251"="    1:Tv value: Quick Control dial, Av value: Main dial";
"10252"="    2:Tv value: Main dial, Av value: Quick Control dial, Av value can be set when lens removed";
"10253"="    3:Tv value: Quick Control dial, Av value: Main dial, Av value can be set when lens removed";
"10254"="    0:1/3-stop set, 1/3-stop comp.";
"10255"="    1:1-stop set, 1/3-stop comp.";
"10256"="    2:1/2-stop set, 1/2-stop comp.";
"10257"="    0:Turns on after One-Shot AF";
"10258"="    1:Turns off after One-Shot AF";
"10259"="    2:Always turned off";
"10260"="    0:Remain. shots/File No.";
"10261"="    1:ISO/Remain. Shots";
"10262"="    2:ISO/File No.";
"10263"="    3:Shots in folder/Remain. shots";
"10264"="    0:0,-,+/Auto cancellation";
"10265"="    1:0,-,+/No cancellation";
"10266"="    2:-,0,+/Auto cancellation";
"10267"="    3:-,0,+/No cancellation";
"10268"="    0:On";
"10269"="    1:Off";
"10270"="    2:On without dimming";
"10271"="    3:Brighter";
"10272"="    0:AF point selection button + Main (horizontal) / Quick Control (vertical) dial operation";
"10273"="    1:Exposure compensation button + Main (horizontal) / Quick Control (vertical) dial operation";
"10274"="    2:Quick Control dial only (horizontal), Assist button + Main dial operation (vertical)";
"10275"="    3:FE lock button + Main (horizontal) / Quick Control (vertical) dial operation";
"10276"="    0:Disable";
"10277"="    1:Enable";
"10278"="    0:45/Center AF point";
"10279"="    1:11/Active AF point";
"10280"="    2:11/Center AF point";
"10281"="    3:9/Active AF point";
"10282"="    0:Enable";
"10283"="    1:Disable";
"10284"="    0:1st-curtain synchronization";
"10285"="    1:2nd-curtain synchronization";
"10286"="    0:Disable";
"10287"="    1:Enable";
"10288"="    0:Single AF point";
"10289"="    1:Expand(TTL. of 7 AF points)";
"10290"="    2:Automatic expand(max. 13)";
"10291"="    0:Assist button + AF point selection button";
"10292"="    1:Switch using assist button only";
"10293"="    2:Only switch while assist button is pressed";
"10294"="    0:AF stop";
"10295"="    1:AF start";
"10296"="    2:AE lock while metering";
"10297"="    3:AF point:M->Auto/Auto->Ctr.";
"10298"="    4:AF mode:ONE SHOT<-->AI SERVO";
"10299"="    5:IS start";
"10300"="    0:Standard";
"10301"="    1:Slow";
"10302"="    2:Moderately slow";
"10303"="    3:Moderately fast";
"10304"="    4:Fast";
"10305"="Auto";
"10306"="On";
"10307"="Off";
"10308"="Built-In Flash";
"10309"="External E-TTL";
"10310"="External A-TTL";
"10311"="1st-curtain sync";
"10312"="2nd-curtain sync";
"10313"="Hi-speed";
"10314"="[ Right ]";
"10315"="[ Center ]";
"10316"="[ Right Center ]";
"10317"="[ Left ]";
"10318"="[ Left Right ]";
"10319"="[ Left Center ]";
"10320"="[ Left Center Right ]";
"10321"="%m/%d/%y %H:%M:%S";
"10322"="mm";
"10323"="KB";
"10324"="(%dK)";
"10325"="Off";
"10326"="Sepia";
"10327"="Black & White";
"10328"="Landscape";
"10329"="Off";
"10330"="On 1";
"10331"="On 2";
"10332"="On";
"10333"="Auto";
"10334"="Contrast      -2";
"10335"="Contrast      -1";
"10336"="Contrast       0";
"10337"="Contrast      +1";
"10338"="Contrast      +2";
"10339"="Color tone    -2";
"10340"="Color tone    -1";
"10341"="Color tone    0";
"10342"="Color tone    +1";
"10343"="Color tone    +2";
"10344"="Filter effect  None";
"10345"="Filter effect  Yellow";
"10346"="Filter effect  Orange";
"10347"="Filter effect  Red";
"10348"="Filter effect  Green";
"10349"="Toning effect  None";
"10350"="Toning effect  Sepia";
"10351"="Toning effect  Blue";
"10352"="Toning effect  Purple";
"10353"="Toning effect  Green";
"10354"="sRGB";
"10355"="Adobe RGB";
"10356"="Color Space   sRGB";
"10357"="Color Space   Adobe RGB";
"10358"="1Standard";
"10359"="2Portrait";
"10360"="3H-saturat.";
"10361"="4Adobe RGB";
"10362"="5L-saturat.";
"10363"="6CM set1";
"10364"="7CM set2";
"10365"="---------";
"10366"="Picture Style";
"10367"="Sharpness";
"10368"="Contrast";
"10369"="Saturation";
"10370"="Color tone";
"10371"="Filter effect";
"10372"="Toning effect";
"10373"="-4";
"10374"="-3";
"10375"="-2";
"10376"="-1";
"10377"="0";
"10378"="1";
"10379"="2";
"10380"="3";
"10381"="4";
"10382"="5";
"10383"="6";
"10384"="7";
"10385"="N :None";
"10386"="Ye:Yellow";
"10387"="Or:Orange";
"10388"="R :Red";
"10389"="G :Green";
"10390"="S :Sepia";
"10391"="B :Blue";
"10392"="P :Purple";
"10393"="Standard";
"10394"="Portrait";
"10395"="Landscape";
"10396"="Neutral";
"10397"="Faithful";
"10398"="Monochrome";
"10399"="User Defined 1";
"10400"="User Defined 2";
"10401"="User Defined 3";
"10402"="SRAW";
"10403"="Date/Time(UTC)";
"10404"="Satellite signal status";
"10405"="OK";
"10406"="NG";
"10407"="Long exposure noise reduction";
"10408"="High ISO speed noise reduction";
"10409"="Highlight tone priority";
"10410"="0:Off";
"10411"="1:Auto";
"10412"="2:On";
"10413"="0:Off";
"10414"="1:On";
"10415"="0:Disable";
"10416"="1:Enable";
"10417"="External TTL";
"10418"="Auto External Metering";
"10419"="Manual External Metering";
"10420"="Manual Flash";
"10421"="Author";
"10422"="Copyright Notice";
"10423"="Auto Lighting Optimizer";
"10424"="0:Standard";
"10425"="1:Low";
"10426"="2:Strong";
"10427"="3:Disable";
"10428"="0:Standard";
"10429"="1:Low";
"10430"="2:Strong";
"10431"="3:Disable";
"10432"="Firmware";
"10433"="AE lock";
"10434"="OFF";
"10435"="ON";
"10436"="Auto ISO Speed";
"10437"="OFF";
"10438"="ON";
"10439"="FE lock";
"10440"="OFF";
"10441"="ON";
"10442"="Peripheral illumination correction";
"10443"="Disable";
"10444"="Enable";
"10445"="Dust Delete Data";
"10446"="No";
"10447"="Yes";
"10448"="Live View Shooting";
"10449"="OFF";
"10450"="ON";
"10451"="E-TTL II flash metering";
"10452"="Evaluative flash metering";
"10453"="Average flash metering";
"10454"="SRAW1";
"10455"="SRAW2";
"10456"="MRAW";
"10457"="Creative Auto";
"10458"="Photo in Movie / MovieSnap";
"10459"="AE Microadjustment";
"10460"="FE Microadjustment";
"10461"="AF area select mode";
"10462"="Manual selection";
"10463"="Spot AF";
"10464"="AF Point expansion";
"10465"="Zone AF";
"10466"="Automatic selection";
"10467"="Movie Crop";
"10468"="Ambience";
"10469"="Standard setting";
"10470"="Vivid";
"10471"="Warm";
"10472"="Soft";
"10473"="Cool";
"10474"="Intense";
"10475"="Darker";
"10476"="Brighter";
"10477"="Monochrome";
"10478"="Effect";
"10479"="Strong";
"10480"="Standard";
"10481"="Low";
"10482"="Low";
"10483"="Medium";
"10484"="High";
"10485"="Sepia";
"10486"="B/W";
"10487"="Blue";
"10488"="Lighting or Scene";
"10489"="Default setting";
"10490"="Daylight";
"10491"="Shade";
"10492"="Cloudy";
"10493"="Tungsten light";
"10494"="Fluorescent light";
"10495"="Sunset";
"10496"="RAW image processing";
"10497"="Distortion correction";
"10498"="Chromatic aberration correction";
"10499"="Resize";
"10500"="Creative filters";
"10501"="Grainy B/W";
"10502"="Soft focus";
"10503"="Toy camera effect";
"10504"="Miniature effect";
"10505"="Creative filter adjustment";
"10506"="Contrast:Standard";
"10507"="Contrast:Low";
"10508"="Contrast:Strong";
"10509"="Color tone:Standard";
"10510"="Color tone:Cool tone";
"10511"="Color tone:Warm tone";
"10512"="Soft focus:Standard";
"10513"="Soft focus:Low";
"10514"="Soft focus:Strong";
"10515"="Aspect ratio";
"10516"="1:1";
"10517"="3:2";
"10518"="4:3";
"10519"="16:9";
"10520"="Movie exposure";
"10521"="Auto";
"10522"="Manual";
"10523"="Video snapshot";
"10524"="Video light";
"10525"="Manual On";
"10526"="Auto On";
"10527"="Auto";
"10528"="Fish-eye effect";
"10529"="Effect:Standard";
"10530"="Effect:Low";
"10531"="Effect:Strong";
"10532"="Standard";
"10533"="Low";
"10534"="Strong";
"10535"="Disable";
"10536"="Scene Intelligent Auto";
"10537"="HDR Shooting";
"10538"="Enable";
"10539"="Disable";
"10540"="Adjust dynamic range";
"10541"="Auto";
"10542"="HDR Effect";
"10543"="Natural";
"10544"="Art standard";
"10545"="Art vivid";
"10546"="Art bold";
"10547"="Art embossed";
"10548"="Auto Image Align";
"10549"="Enable";
"10550"="Disable";
"10551"="Multiple exposure";
"10552"="Enable";
"10553"="Disable";
"10554"="Multiple exposure control";
"10555"="Additive";
"10556"="Average";
"10557"="Bright(Comparative)";
"10558"="Dark(Comparative)";
"10559"="No. of exposures";
"10560"="AF Point expansion:top/bottom/left/right";
"10561"="AF Point expansion:surround";
"10562"="Movie quality";
"10563"="High compression(inter frame, IPB)";
"10564"="Low compression(intra frame, ALL-I)";
"10565"="Standard";
"10566"="Low";
"10567"="Strong";
"10568"="Disable";
"10569"="Disable";
"10570"="Enable";
"10571"="Disable";
"10572"="Auto";
"10573"="Enable";
"10574"="Silent single shooting";
"10575"="Silent continuous shoot.";
"10576"="SingleSilent";
"10577"="14fps super high speed";
"10578"="AF Configuration Tool";
"10579"="Tracking sensitivity";
"10580"="Accel./decel. tracking";
"10581"="AF point auto switching";
"10582"="Individual group control";
"10583"="First-curtain synchronization";
"10584"="Second-curtain synchronization";
"10585"="High-speed synchronization";
"10586"="Handheld Night Scene";
"10587"="HDR Backlight Control";
"10588"="Movie Servo AF";
"10589"="Enable";
"10590"="Disable";
"10591"="Continuous AF";
"10592"="Enable";
"10593"="Disable";
"10594"="Face detection + Tracking AF";
"10595"="FlexiZone - Multi";
"10596"="FlexiZone - Single";
"10597"="Multi Shot Noise Reduction";
"10598"="Art Bold Effect";
"10599"="Effect:Standard";
"10600"="Effect:Low";
"10601"="Effect:High";
"10602"="Water Painting Effect";
"10603"="Color density:Standard";
"10604"="Color density:Light";
"10605"="Color density:Deep";
"10606"="Servo AF";
"10607"="Canon Log";
"10608"="On";
"10609"="Off";
"10610"="Sharpness";
"10611"="Saturation";
"10612"="Hue";
"10613"="Movie splitting flag";
"10614"="Present";
"10615"="Compression format";
"10616"="MPEG-4 AVC/H.264";
"10617"="Motion JPEG";
"10618"="Recording Time";
"10619"="%d.%d seconds";
"10620"="Frame Rate";
"10621"="Super 35mm crop";
"10622"="Color Tone of Lighting";
"10623"="Cropping";
"10624"="Cool";
"10625"="Slightly Cool";
"10626"="Standard";
"10627"="Slightly Warm";
"10628"="Warm";
"10629"="3:4";
"10630"="2:3";
"10631"="9:16";
"10632"="Kids";
"10633"="Food";
"10634"="Candlelight";
"10635"="Miniature effect movie";
"10636"="External Flash";
"10637"="TTL flash metering";
"10638"="A-TTL flash metering";
"10639"="E-TTL flash metering";
"10640"="Auto flash metering";
"10641"="Manual flash metering";
"10642"="Face live mode";
"10643"="Manual select.:Large Zone AF";
"10644"="Anti-flicker shoot.";
"10645"="Disable";
"10646"="Enable";
"10647"="Enable(Correction data not available)";
"10648"="Editing (ALL-I)";
"10649"="Standard (IPB)";
"10650"="Light (IPB)";
"10651"="Night Portrait";
"10652"="Creative Assist";
"10653"="High Dynamic Range";
"10654"="1-point AF";
"10655"="Hybrid Auto";
"10656"="Digest";
"10657"="HDR Movie Shooting";
"10658"="Auto: Ambience priority";
"10659"="Auto: White priority";
"10660"="Fine Detail";
"10661"="Strength";
"10662"="Fineness";
"10663"="Threshold";
"10664"="Time-lapse movie";
"10665"="Crop/aspect ratio";
"10666"="1.3x (crop)";
"10667"="1.6x (crop)";
"10668"="Self Portrait";
"10669"="HDR art bold";
"10670"="HDR art vivid";
"10671"="HDR art embossed";
"10672"="HDR art standard";
"10673"="Dream";
"10674"="Old Movies";
"10675"="Memory";
"10676"="Dramatic B&W";
"10677"="Miniature effect movie";
"10678"="Diffraction correction";
"10679"="Enable";
"10680"="Disable";
"10681"="Digital Lens Optimizer";
"10682"="Frame Grab";
"10683"="Silent HS continuous";
"10684"="Silent LS continuous";
"10685"="Dual Pixel RAW";
